app/controllers/articles_controller.rb

  def index
    @articles = Article.all.paginate(page: params[:page], per_page: 2)
    @last5 = Article.last(5)
---
SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 5]]

  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test1"], ["body", "updated controller\r\n"], ["created_at", "2022-05-26 23:33:49.706255"], ["updated_at", "2022-05-26 23:33:49.706255"], ["user_id", 3]]